#include<string>
#include<cstring>
using namespace std;


string byond_utf_c[] = {"&#1040;","&#1041;","&#1042;","&#1043;","&#1044;","&#1045;","&#1046;","&#1047;","&#1048;","&#1049;","&#1050;","&#1051;","&#1052;","&#1053;","&#1054;","&#1055;","&#1056;","&#1057;","&#1058;","&#1059;","&#1060;","&#1061;","&#1062;","&#1063;","&#1064;","&#1065;","&#1066;","&#1067;","&#1068;","&#1069;","&#1070;","&#1071;","&#1072;","&#1073;","&#1074;","&#1075;","&#1076;","&#1077;","&#1078;","&#1079;","&#1080;","&#1081;","&#1082;","&#1083;","&#1084;","&#1085;","&#1086;","&#1087;","&#1088;","&#1089;","&#1090;","&#1091;","&#1092;","&#1093;","&#1094;","&#1095;","&#1096;","&#1097;","&#1098;","&#1099;","&#1100;","&#1101;","&#1102;","&#1103;","&#1105;","&#1025;"};
string normal_sim_c[] = {"À","Á","Â","Ã","Ä","Å","Æ","Ç","È","É","Ê","Ë","Ì","Í","Î","Ï","Ð","Ñ","Ò","Ó","Ô","Õ","Ö","×","Ø","Ù","Ú","Û","Ü","Ý","Þ","ß","à","á","â","ã","ä","å","æ","ç","è","é","ê","ë","ì","í","î","ï","ð","ñ","ò","ó","ô","õ","ö","÷","ø","ù","ú","û","ü","ý","þ","ÿ","¨","¸"};

string replace_s(string str, string seach, string rep)
{
    size_t find_s = str.find(seach);///Pos
    if(find_s <= str.size())
    {
        int e_pos = seach.size() + find_s; ///End pos
        if((size_t)e_pos <= str.size())
        {
            str.replace(find_s,e_pos, rep);
        }
    }
    return str;
}

extern "C" __declspec(dllexport) char* ru_log(int argc, char* argv[])
{
    char *data = argv[0];
    string str = data;
    string pre = replace_s(str,byond_utf_c[0],normal_sim_c[0]);
    for(unsigned int i=0;i<sizeof(byond_utf_c);i++)
    {
     while(str != pre)
     {
         str = pre;
         pre = replace_s(str,byond_utf_c[i],normal_sim_c[i]);
     }
    }
    return (char*)str.c_str();
}
